dgarske/wolfssl-examples/rtl8735b/main.c
/* wolfCrypt AmebaPro2 (RTL8735B) HUK example -- built inside the RealTek
 * FreeRTOS SDK. Registers the wolfCrypt HUK crypto-callback device and runs
 * AES-GCM (full payload) / AES-ECB / AES-CBC / AES-CTR, HMAC-SHA256, and ECDSA
 * P-256 under a key derived from the silicon Hardware Unique Key; the working
 * key never enters software. The 256-bit "seed" passed as the key is HKDF input
 * diversifying the HUK. It also runs regression checks: unaligned-buffer GCM
 * (port bounce path), in-place multi-call CBC, and a non-12-byte GCM IV that
 * must hard-fail (no silent software fallback).
 *
 * Build: configure with -DEXAMPLE=wolfcrypt_huk (see wolfcrypt_huk.cmake).
 */

#include <string.h>

#include "platform_stdlib.h"
#include "FreeRTOS.h"
#include "task.h"
#include "device_lock.h"
#include "hal_trng_sec.h"

#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/wc_port.h>
#include <wolfssl/wolfcrypt/aes.h>
#include <wolfssl/wolfcrypt/hmac.h>
#include <wolfssl/wolfcrypt/ecc.h>
#include <wolfssl/wolfcrypt/random.h>
#include <wolfssl/wolfcrypt/error-crypt.h>
#include <wolfssl/wolfcrypt/port/realtek/rtl8735b.h>

/* ForceZero (used to scrub key material below). Inline the misc helpers the same
 * way wolfCrypt's own test.c/benchmark.c do; misc.c provides ForceZero only as an
 * inline, so a plain extern reference would not link. */
#ifdef NO_INLINE
    #include <wolfssl/wolfcrypt/misc.h>
#else
    #define WOLFSSL_MISC_INCLUDED
    #include <wolfcrypt/src/misc.c>
#endif

#define STACKSIZE 8192

#define CHECK(label, cond) \
    dbg_printf("[%s] %s\r\n", (cond) ? "PASS" : "FAIL", (label))

/* wolfCrypt RNG seed hook (user_settings: CUSTOM_RAND_GENERATE_SEED). Fills from
 * the AmebaPro2 secure (self-tested) hardware TRNG -- the same source the HUK
 * port exposes as a crypto-callback SEED. (Using the secure TRNG directly also
 * avoids the non-secure hal_trng wrapper, whose C-cut path references a ROM
 * symbol not resolvable in a from-source SDK build.) */
int rtl8735b_rand_seed(unsigned char* output, unsigned int sz)
{
    static int inited = 0;
    unsigned int i, n;
    u32 r;

    if (inited == 0) {
        if (hal_trng_sec_init() != 0) {
            return -1;
        }
        inited = 1;
    }
    for (i = 0; i < sz; ) {
        r = hal_trng_sec_get_rand();
        n = (sz - i) < 4u ? (sz - i) : 4u;
        memcpy(output + i, &r, n);
        i += n;
    }
    return 0;
}

static void huk_gcm_test(void)
{
    Aes  aes;
    /* HAL crypto engine requires 32-byte-aligned key/iv/aad/tag buffers. */
    byte seed[32] __attribute__((aligned(32)));
    byte iv[12]   __attribute__((aligned(32)));
    byte aad[16]  __attribute__((aligned(32)));
    byte pt[32]   __attribute__((aligned(32)));
    byte ct[32]   __attribute__((aligned(32)));
    byte dec[32]  __attribute__((aligned(32)));
    byte tag[16]  __attribute__((aligned(32)));
    byte tag2[16] __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0xA5, sizeof(seed)); memset(iv, 0x11, sizeof(iv));
    memset(aad, 0x22, sizeof(aad));   memset(pt, 0x33, sizeof(pt));

    dbg_printf("\r\n== AES-GCM (full payload) under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    CHECK("AesGcmSetKey(seed,32)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }

    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag, sizeof(tag), aad, sizeof(aad));
    CHECK("AesGcmEncrypt", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }

    memset(tag2, 0, sizeof(tag2));
    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag2, sizeof(tag2), aad, sizeof(aad));
    CHECK("deterministic tag", ret == 0 && memcmp(tag, tag2, 16) == 0);

    ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                           tag, sizeof(tag), aad, sizeof(aad));
    CHECK("AesGcmDecrypt verifies", ret == 0);
    CHECK("plaintext round-trips", memcmp(dec, pt, sizeof(pt)) == 0);

    seed[0] ^= 0xFF;
    ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    CHECK("AesGcmSetKey(wrong seed)", ret == 0);
    ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                           tag, sizeof(tag), aad, sizeof(aad));
    CHECK("wrong seed -> AES_GCM_AUTH_E", ret == AES_GCM_AUTH_E);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

#ifdef WOLFSSL_RTL8735B_AES
/* AES-GCM with a plaintext key through the second device (WC_RTL8735B_AES_DEVID).
 * Unlike the HUK device, the key bytes are the actual AES key, so the output
 * matches a published GCM vector. Then the same 32 key bytes are run through
 * both devices to show they coexist and are selected per Aes by devId: the
 * plaintext-key ciphertext differs from the HUK device-bound ciphertext. */
static void plain_gcm_test(void)
{
    Aes  aes;
    /* McGrew & Viega GCM test case 3: 128-bit key, 64-byte payload, no AAD. */
    static const byte katKey[16] = {
        0xfe,0xff,0xe9,0x92,0x86,0x65,0x73,0x1c,
        0x6d,0x6a,0x8f,0x94,0x67,0x30,0x83,0x08
    };
    static const byte katIv[12] = {
        0xca,0xfe,0xba,0xbe,0xfa,0xce,0xdb,0xad,0xde,0xca,0xf8,0x88
    };
    static const byte katPt[64] = {
        0xd9,0x31,0x32,0x25,0xf8,0x84,0x06,0xe5,
        0xa5,0x59,0x09,0xc5,0xaf,0xf5,0x26,0x9a,
        0x86,0xa7,0xa9,0x53,0x15,0x34,0xf7,0xda,
        0x2e,0x4c,0x30,0x3d,0x8a,0x31,0x8a,0x72,
        0x1c,0x3c,0x0c,0x95,0x95,0x68,0x09,0x53,
        0x2f,0xcf,0x0e,0x24,0x49,0xa6,0xb5,0x25,
        0xb1,0x6a,0xed,0xf5,0xaa,0x0d,0xe6,0x57,
        0xba,0x63,0x7b,0x39,0x1a,0xaf,0xd2,0x55
    };
    static const byte katCt[64] = {
        0x42,0x83,0x1e,0xc2,0x21,0x77,0x74,0x24,
        0x4b,0x72,0x21,0xb7,0x84,0xd0,0xd4,0x9c,
        0xe3,0xaa,0x21,0x2f,0x2c,0x02,0xa4,0xe0,
        0x35,0xc1,0x7e,0x23,0x29,0xac,0xa1,0x2e,
        0x21,0xd5,0x14,0xb2,0x54,0x66,0x93,0x1c,
        0x7d,0x8f,0x6a,0x5a,0xac,0x84,0xaa,0x05,
        0x1b,0xa3,0x0b,0x39,0x6a,0x0a,0xac,0x97,
        0x3d,0x58,0xe0,0x91,0x47,0x3f,0x59,0x85
    };
    static const byte katTag[16] = {
        0x4d,0x5c,0x2a,0xf3,0x27,0xcd,0x64,0xa6,
        0x2c,0xf3,0x5a,0xbd,0x2b,0xa6,0xfa,0xb4
    };
    /* HAL crypto engine requires 32-byte-aligned key/iv/buffers. */
    byte key[32]   __attribute__((aligned(32)));
    byte iv[12]    __attribute__((aligned(32)));
    byte pt[64]    __attribute__((aligned(32)));
    byte ct[64]    __attribute__((aligned(32)));
    byte ctHuk[64] __attribute__((aligned(32)));
    byte dec[64]   __attribute__((aligned(32)));
    byte tag[16]   __attribute__((aligned(32)));
    byte tagHuk[16] __attribute__((aligned(32)));
    int  ret;

    dbg_printf("\r\n== AES-GCM with a plaintext key "
               "(devId=WC_RTL8735B_AES_DEVID) ==\r\n");

