dgarske/wolfssl-examples/rtl8735b/main.c
    /* Known-answer test: the plaintext key must reproduce the published vector. */
    memcpy(iv, katIv, sizeof(iv));
    memcpy(pt, katPt, sizeof(pt));
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    CHECK("AesInit(devId=WC_RTL8735B_AES_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, katKey, sizeof(katKey));
    CHECK("AesGcmSetKey(plaintext 128-bit key)", ret == 0);
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
        CHECK("AesGcmEncrypt", ret == 0);
    }
    CHECK("ciphertext matches published vector",
          ret == 0 && memcmp(ct, katCt, sizeof(katCt)) == 0);
    CHECK("tag matches published vector",
          ret == 0 && memcmp(tag, katTag, sizeof(katTag)) == 0);
    if (ret == 0) {
        ret = wc_AesGcmDecrypt(&aes, dec, ct, sizeof(ct), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
        CHECK("AesGcmDecrypt verifies", ret == 0);
        CHECK("plaintext round-trips", memcmp(dec, pt, sizeof(pt)) == 0);
    }
    wc_AesFree(&aes);

    /* Coexistence: same 32 key bytes -> plaintext device vs HUK device produce
     * different ciphertext (one uses the key verbatim, the other as a seed). */
    memset(key, 0x5A, sizeof(key));
    ret = wc_AesInit(&aes, NULL, WC_RTL8735B_AES_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, key, sizeof(key));
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                               tag, sizeof(tag), NULL, 0);
    }
    wc_AesFree(&aes);
    CHECK("plaintext-key encrypt (256-bit)", ret == 0);
    if (ret == 0) {
        ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
        if (ret == 0) {
            ret = wc_AesGcmSetKey(&aes, key, sizeof(key));
        }
        if (ret == 0) {
            ret = wc_AesGcmEncrypt(&aes, ctHuk, pt, sizeof(pt), iv, sizeof(iv),
                                   tagHuk, sizeof(tagHuk), NULL, 0);
        }
        wc_AesFree(&aes);
        CHECK("HUK-seed encrypt (same 32 bytes)", ret == 0);
        CHECK("plaintext CT != HUK CT (distinct keys per devId)",
              ret == 0 && memcmp(ct, ctHuk, sizeof(ct)) != 0);
    }
    ForceZero(key, sizeof(key));   /* scrub key material before return */
}
#endif /* WOLFSSL_RTL8735B_AES */

static void huk_ecb_cbc_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));
    byte pt[32]   __attribute__((aligned(32)));
    byte ct[32]   __attribute__((aligned(32)));
    byte dec[32]  __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0x5A, sizeof(seed)); memset(iv, 0x44, sizeof(iv));
    memset(pt, 0x77, sizeof(pt));

    dbg_printf("\r\n== AES-ECB under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL, AES_ENCRYPTION);
    CHECK("AesSetKey(ECB enc)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesEcbEncrypt(&aes, ct, pt, sizeof(pt));
    CHECK("AesEcbEncrypt", ret == 0);
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), NULL, AES_DECRYPTION);
    CHECK("AesSetKey(ECB dec)", ret == 0);
    ret = wc_AesEcbDecrypt(&aes, dec, ct, sizeof(ct));
    CHECK("AesEcb round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);

    dbg_printf("\r\n== AES-CBC under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKey(CBC enc)", ret == 0);
    ret = wc_AesCbcEncrypt(&aes, ct, pt, sizeof(pt));
    CHECK("AesCbcEncrypt", ret == 0);
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_DECRYPTION);
    CHECK("AesSetKey(CBC dec)", ret == 0);
    ret = wc_AesCbcDecrypt(&aes, dec, ct, sizeof(ct));
    CHECK("AesCbc round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

static void huk_ctr_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));
    byte pt[20]   __attribute__((aligned(32))); /* non-block-multiple: partial */
    byte ct[20]   __attribute__((aligned(32)));
    byte dec[20]  __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0x5A, sizeof(seed)); memset(iv, 0x66, sizeof(iv));
    memset(pt, 0x99, sizeof(pt));

    dbg_printf("\r\n== AES-CTR under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKeyDirect(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKeyDirect(CTR)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesCtrEncrypt(&aes, ct, pt, sizeof(pt));
    CHECK("AesCtrEncrypt", ret == 0);
    CHECK("CTR ciphertext != plaintext", memcmp(ct, pt, sizeof(pt)) != 0);
    wc_AesFree(&aes);

    /* CTR is its own inverse with the same key+IV */
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKeyDirect(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKeyDirect(CTR round-trip)", ret == 0);
    ret = wc_AesCtrEncrypt(&aes, dec, ct, sizeof(ct));
    CHECK("AesCtr round-trip", ret == 0 && memcmp(dec, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

static void huk_gcm_unaligned_test(void)
{
    Aes   aes;
    /* 32-byte-aligned backing; the +1 views below are deliberately unaligned so
     * the port's bounce-to-aligned path is exercised. */
    byte  buf[7][48] __attribute__((aligned(32)));
    byte* seed = buf[0] + 1;
    byte* iv   = buf[1] + 1;
    byte* aad  = buf[2] + 1;
    byte* pt   = buf[3] + 1;
    byte* ct   = buf[4] + 1;
    byte* dec  = buf[5] + 1;
    byte* tag  = buf[6] + 1;
    int   ret;

    memset(seed, 0xA5, 32); memset(iv, 0x11, 12);
    memset(aad, 0x22, 16);  memset(pt, 0x33, 32);

    dbg_printf("\r\n== AES-GCM with UNALIGNED buffers (port bounces) ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, seed, 32);
    CHECK("AesGcmSetKey (unaligned seed)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesGcmEncrypt(&aes, ct, pt, 32, iv, 12, tag, 16, aad, 16);
    CHECK("AesGcmEncrypt (unaligned)", ret == 0);
    ret = wc_AesGcmDecrypt(&aes, dec, ct, 32, iv, 12, tag, 16, aad, 16);
    CHECK("AesGcmDecrypt (unaligned) verifies", ret == 0);
    CHECK("unaligned round-trip", memcmp(dec, pt, 32) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, 32);   /* scrub key material before return */
}

