dgarske/wolfssl-examples/rtl8735b/main.c
/* In-place CBC decrypt (in == out) across two chained calls -- regression for
 * the in-place chaining / IV-advance fix. */
static void huk_cbc_inplace_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));
    byte pt[48]   __attribute__((aligned(32)));   /* 3 blocks */
    byte buf[48]  __attribute__((aligned(32)));    /* encrypted then decrypted in place */
    int  ret, i;

    memset(seed, 0x5A, sizeof(seed)); memset(iv, 0x44, sizeof(iv));
    for (i = 0; i < (int)sizeof(pt); i++) {
        pt[i] = (byte)i;
    }
    memcpy(buf, pt, sizeof(pt));

    dbg_printf("\r\n== AES-CBC in-place + multi-call under HUK-derived key ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_ENCRYPTION);
    CHECK("AesSetKey(CBC enc)", ret == 0);
    ret = wc_AesCbcEncrypt(&aes, buf, buf, sizeof(buf));   /* in == out */
    CHECK("CBC in-place encrypt", ret == 0);
    wc_AesFree(&aes);

    /* Decrypt in place across two calls (32 then 16 bytes) -- the 2nd call relies
     * on aes->reg having been advanced to the correct last-ciphertext block. */
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesSetKey(&aes, seed, sizeof(seed), iv, AES_DECRYPTION);
    CHECK("AesSetKey(CBC dec)", ret == 0);
    ret = wc_AesCbcDecrypt(&aes, buf, buf, 32);
    if (ret == 0) {
        ret = wc_AesCbcDecrypt(&aes, buf + 32, buf + 32, 16);
    }
    CHECK("CBC in-place multi-call decrypt", ret == 0);
    CHECK("CBC in-place round-trip", memcmp(buf, pt, sizeof(pt)) == 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

/* A non-12-byte GCM IV must hard-fail, NOT silently fall back to software GCM
 * keyed on the seed -- regression for the IV hard-error fix. */
static void huk_gcm_badiv_test(void)
{
    Aes  aes;
    byte seed[32] __attribute__((aligned(32)));
    byte iv[16]   __attribute__((aligned(32)));   /* 16 bytes, not the supported 12 */
    byte pt[16]   __attribute__((aligned(32)));
    byte ct[16]   __attribute__((aligned(32)));
    byte tag[16]  __attribute__((aligned(32)));
    int  ret;

    memset(seed, 0xA5, sizeof(seed)); memset(iv, 0x11, sizeof(iv));
    memset(pt, 0x33, sizeof(pt));

    dbg_printf("\r\n== AES-GCM non-12-byte IV must hard-fail ==\r\n");
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    CHECK("AesInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    CHECK("AesGcmSetKey(seed,32)", ret == 0);
    if (ret != 0) {
        wc_AesFree(&aes);
        return;
    }
    ret = wc_AesGcmEncrypt(&aes, ct, pt, sizeof(pt), iv, sizeof(iv),
                           tag, sizeof(tag), NULL, 0);
    CHECK("16-byte IV rejected (no silent SW fallback)", ret != 0);
    wc_AesFree(&aes);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

/* HMAC-SHA256 under the HUK-derived key: same seed -> same MAC (deterministic),
 * a different seed -> different MAC. The 32-byte seed is the HMAC key; the port
 * runs the MAC over the HUK-derived secure-key slot (key never in software). */
static void huk_hmac_test(void)
{
    Hmac hmac;
    byte seed[32] __attribute__((aligned(32)));
    byte msg[40]  __attribute__((aligned(32)));
    byte mac1[WC_SHA256_DIGEST_SIZE];
    byte mac2[WC_SHA256_DIGEST_SIZE];
    byte mac3[WC_SHA256_DIGEST_SIZE];
    int  ret;

    memset(seed, 0x5A, sizeof(seed));
    memset(msg, 0x33, sizeof(msg));

    dbg_printf("\r\n== HMAC-SHA256 under HUK-derived key ==\r\n");

    ret = wc_HmacInit(&hmac, NULL, WC_HUK_DEVID);
    CHECK("HmacInit(devId=WC_HUK_DEVID)", ret == 0);
    if (ret != 0) {
        return;
    }
    ret = wc_HmacSetKey(&hmac, WC_SHA256, seed, sizeof(seed));
    CHECK("HmacSetKey(seed,32)", ret == 0);
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, msg, sizeof(msg));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, mac1);
    }
    CHECK("HmacFinal", ret == 0);
    wc_HmacFree(&hmac);
    if (ret != 0) {
        return;
    }

    /* Same seed + message -> identical MAC. */
    ret = wc_HmacInit(&hmac, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_HmacSetKey(&hmac, WC_SHA256, seed, sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, msg, sizeof(msg));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, mac2);
    }
    wc_HmacFree(&hmac);
    CHECK("deterministic MAC", ret == 0 &&
          memcmp(mac1, mac2, sizeof(mac1)) == 0);

    /* Different seed -> different MAC. */
    seed[0] ^= 0xFF;
    ret = wc_HmacInit(&hmac, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_HmacSetKey(&hmac, WC_SHA256, seed, sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, msg, sizeof(msg));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, mac3);
    }
    wc_HmacFree(&hmac);
    CHECK("wrong seed -> different MAC", ret == 0 &&
          memcmp(mac1, mac3, sizeof(mac1)) != 0);
    ForceZero(seed, sizeof(seed));   /* scrub key material before return */
}

/* HUK-bound ECDSA P-256 sign. A key is generated in software, its private
 * scalar wrapped under the HUK (ECB-encrypted with the HUK device using the
 * seed), then signing goes through the HUK device (which unwraps under the HUK
 * and signs). The signature is checked against the software public key. To
 * exercise the HW ECDSA engine instead of the software-after-unwrap path, set
 * hk.useHwEngine = 1 (requires on-silicon validation). */
static void huk_ecdsa_test(void)
{
    Aes    aes;
    ecc_key key;
    ecc_key huk;
    ecc_key hwpub;
    WC_RNG  rng;
    wc_Rtl8735b_EccKey hk;
    byte    seed[32]    __attribute__((aligned(32)));
    byte    d[32]       __attribute__((aligned(32)));
    byte    wrapped[32] __attribute__((aligned(32)));
    byte    wrapIv[12]  __attribute__((aligned(32)));   /* GCM nonce for the wrap */
    byte    wrapTag[16] __attribute__((aligned(32)));   /* GCM auth tag */
    byte    hash[32]    __attribute__((aligned(32)));
    byte    qx[32];
    byte    qy[32];
    byte    sig[80];
    word32  dLen = sizeof(d);
    word32  qxLen = sizeof(qx);
    word32  qyLen = sizeof(qy);
    word32  sigLen = sizeof(sig);
    int     ret;
    int     verified = 0;
    int     hwVerified = 0;
    int     rngOk = 0;

    memset(seed, 0x6B, sizeof(seed));
    memset(hash, 0x42, sizeof(hash));
    memset(d, 0, sizeof(d));
    /* Zero the key structs up front so the single cleanup can wc_ecc_free them
     * safely even if an earlier step fails before they are initialized. */
    memset(&key, 0, sizeof(key));
    memset(&huk, 0, sizeof(huk));
    memset(&hwpub, 0, sizeof(hwpub));

    dbg_printf("\r\n== ECDSA P-256 under HUK-derived key ==\r\n");

