dgarske/wolfssl-examples/rtl8735b/main.c
    ret = wc_InitRng(&rng);
    CHECK("InitRng", ret == 0);
    if (ret != 0) {
        goto cleanup;
    }
    rngOk = 1;
    ret = wc_ecc_init(&key);
    if (ret == 0) {
        ret = wc_ecc_make_key(&rng, 32, &key);
    }
    CHECK("ecc_make_key (P-256)", ret == 0);
    if (ret != 0) {
        goto cleanup;
    }
    ret = wc_ecc_export_private_only(&key, d, &dLen);
    CHECK("export private scalar (32B)", ret == 0 && dLen == 32);
    if (ret != 0 || dLen != 32) {
        goto cleanup;
    }

    /* Wrap the scalar under the HUK: AES-GCM-encrypt with the HUK device + seed
     * so the blob is authenticated (a tampered/wrong blob fails at unwrap). */
    memset(wrapIv, 0x24, sizeof(wrapIv));   /* demo nonce; use a fresh one/provision */
    ret = wc_AesInit(&aes, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, seed, sizeof(seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, wrapped, d, sizeof(d), wrapIv, sizeof(wrapIv),
                               wrapTag, sizeof(wrapTag), NULL, 0);
    }
    wc_AesFree(&aes);
    CHECK("wrap scalar under HUK (GCM)", ret == 0);
    if (ret != 0) {
        goto cleanup;
    }

    /* Sign via the HUK-bound key (GCM-unwraps under the HUK, then signs). */
    memset(&hk, 0, sizeof(hk));
    hk.seed = seed;       hk.seedSz = sizeof(seed);
    hk.wrapped = wrapped; hk.wrappedLen = 32;
    hk.plainLen = 32;
    hk.iv = wrapIv;       hk.ivSz = sizeof(wrapIv);
    hk.tag = wrapTag;     hk.tagSz = sizeof(wrapTag);
    /* Route the sign through the HW ECDSA engine (hal_ecdsa, validated on the
     * RTL8735B). Set 0 for the software-after-unwrap path (the port default).
     * hk.otpPrkSel can instead select an OTP-resident key (scalar never in
     * software); see wolfcrypt/src/port/realtek/README.md. */
    hk.useHwEngine = 1;

    ret = wc_ecc_init_ex(&huk, NULL, WC_HUK_DEVID);
    if (ret == 0) {
        ret = wc_ecc_set_curve(&huk, 32, ECC_SECP256R1);
    }
    if (ret == 0) {
        huk.devCtx = &hk;
        ret = wc_ecc_sign_hash(hash, sizeof(hash), sig, &sigLen, &rng, &huk);
    }
    CHECK("HUK ECDSA sign", ret == 0);

    if (ret == 0) {
        ret = wc_ecc_verify_hash(sig, sigLen, hash, sizeof(hash), &verified,
                                 &key);
    }
    CHECK("verify with software public key", ret == 0 && verified == 1);

    /* Verify the same signature through the HW ECDSA engine (general verify
     * offload): import the public point into a WC_HUK_DEVID key so the verify
     * dispatches to hal_ecdsa. A good signature -> res = 1; a tampered hash
     * must -> res = 0 (and still return 0, since a bad signature is not an
     * error). No HUK context is needed for verify -- any P-256 public key. */
    ret = wc_ecc_export_public_raw(&key, qx, &qxLen, qy, &qyLen);
    CHECK("export public point", ret == 0);
    if (ret == 0) {
        ret = wc_ecc_init_ex(&hwpub, NULL, WC_HUK_DEVID);
    }
    if (ret == 0) {
        ret = wc_ecc_import_unsigned(&hwpub, qx, qy, NULL, ECC_SECP256R1);
    }
    if (ret == 0) {
        hwVerified = 0;
        ret = wc_ecc_verify_hash(sig, sigLen, hash, sizeof(hash), &hwVerified,
                                 &hwpub);
    }
    CHECK("HW ECDSA verify (good sig)", ret == 0 && hwVerified == 1);

    if (ret == 0) {
        hash[0] ^= 0xFF;     /* tamper the digest */
        hwVerified = 1;
        ret = wc_ecc_verify_hash(sig, sigLen, hash, sizeof(hash), &hwVerified,
                                 &hwpub);
        hash[0] ^= 0xFF;     /* restore */
    }
    CHECK("HW ECDSA verify (tampered -> reject)", ret == 0 && hwVerified == 0);

cleanup:
    wc_ecc_free(&hwpub);
    wc_ecc_free(&huk);
    wc_ecc_free(&key);
    if (rngOk != 0) {
        wc_FreeRng(&rng);
    }
    /* Scrub the plaintext private scalar, its wrapped form, and the HKDF seed
     * (zero secrets with ForceZero, not memset, per wolfSSL convention). */
    ForceZero(d, sizeof(d));
    ForceZero(wrapped, sizeof(wrapped));
    ForceZero(seed, sizeof(seed));
}

static void wolf_huk_thread(void* param)
{
    int ret;
    (void)param;

    dbg_printf("\r\n=== wolfCrypt AmebaPro2 (RTL8735B) HUK example ===\r\n");

    device_mutex_lock(RT_DEV_LOCK_CRYPTO);

    ret = wolfCrypt_Init();
    CHECK("wolfCrypt_Init", ret == 0);

    if (ret == 0) {
        ret = wc_Rtl8735b_HukRegister(WC_HUK_DEVID);
        CHECK("wc_Rtl8735b_HukRegister", ret == 0);
    }
#ifdef WOLFSSL_RTL8735B_AES
    if (ret == 0) {
        ret = wc_Rtl8735b_AesRegister(WC_RTL8735B_AES_DEVID);
        CHECK("wc_Rtl8735b_AesRegister", ret == 0);
    }
#endif
    if (ret == 0) {
        huk_gcm_test();
        huk_ecb_cbc_test();
        huk_ctr_test();
        huk_gcm_unaligned_test();
        huk_cbc_inplace_test();
        huk_gcm_badiv_test();
        huk_hmac_test();
        huk_ecdsa_test();
#ifdef WOLFSSL_RTL8735B_AES
        plain_gcm_test();
        wc_Rtl8735b_AesUnRegister(WC_RTL8735B_AES_DEVID);
#endif
        wc_Rtl8735b_HukUnRegister(WC_HUK_DEVID);
    }
    wolfCrypt_Cleanup();

    device_mutex_unlock(RT_DEV_LOCK_CRYPTO);
    dbg_printf("\r\n=== done ===\r\n");
    vTaskDelete(NULL);
}

int main(void)
{
    if (xTaskCreate(wolf_huk_thread, "wolf_huk", STACKSIZE, NULL,
                    tskIDLE_PRIORITY + 1, NULL) != pdPASS) {
        dbg_printf("xTaskCreate failed\r\n");
    }
    else {
        vTaskStartScheduler();
    }
    while (1) {
    }
}
